Repository: amirghari/Expense-Reminder
Catalog: Expense Reminder/*.lproj/Localizable.strings
Languages: fi

# total_spent
source: Total Spent: $%.2f
fi: Käytetty yhteensä: $%.2f

# remaining_budget
source: Remaining Budget: $%.2f
fi: Jäljellä oleva budjetti: $%.2f

# budget_exceeded_title
source: Budget Exceeded!
fi: Budjetti ylitetty!

# budget_exceeded_message
source: You have exceeded your budget limit. Please review your expenses.
fi: Olet ylittänyt budjettirajasi. Tarkista kulutuksesi.

# budget_alert_title
source: Budget Alert
fi: Budjettihälytys

# budget_alert_message
source: You've reached %d%% of your monthly budget.
fi: Olet saavuttanut %d%% kuukausibudjetistasi.

# add_expense_title
source: Add New Expense
fi: Lisää uusi kulu

# select_category_title
source: Select Category
fi: Valitse kategoria

# enter_amount_placeholder
source: Enter Amount
fi: Syötä määrä

# add_note_placeholder
source: Add a Note (Optional)
fi: Lisää huomautus (valinnainen)

# save_expense_button
source: Save Expense
fi: Tallenna kulu

# selected_category_title
source: Selected Category:
fi: Valittu kategoria:

# budget_settings_title
source: Budget Settings
fi: Budjetin asetukset

source: Monthly Budget Limit
fi: Kuukausittainen budjetin raja

# enter_budget_limit_placeholder
source: Enter budget limit
fi: Syötä budjetin raja

# cancel_button
source: Cancel
fi: Peruuta

# save_button
source: Save
fi: Tallenna

# set_budget_title
source: Set Budget
fi: Aseta Budjetti

# enter_monthly_budget_placeholder
source: Enter Monthly Budget
fi: Syötä kuukausittainen budjetti

source: Select Category
fi: Valitse kategoria

source: Food
fi: Ruoka

source: Food
fi: Ruoka

source: Transport
fi: Liikenne

source: Entertainment
fi: Viihde

source: Your Expenses
fi: Sinun kulut

# no_expenses
source: No expenses added yet.
fi: Ei lisättyjä kuluja vielä.

# welcome_title
source: Welcome to Expense Tracker
fi: Tervetuloa Kulujen Seurantaan

# budget_limit
source: Budget Limit: $%.2f
fi: Budjetin raja: €%.2f

source: View Expenses
fi: Näytä kulut

source: Set Budget
fi: Aseta budjetti

source: Settings
fi: Asetukset

source: Add Expense
fi: Lisää kulu

# settings_title
source: Settings
fi: Asetukset

source: Enable Notifications
fi: Ota ilmoitukset käyttöön

source: Dark Mode
fi: Tumma tila

source: Reset Expenses
fi: Nollaa kulut

# reset_expenses_confirmation
source: Are you sure you want to reset all your expenses?
fi: Oletko varma, että haluat nollata kaikki kulusi?

source: Reset
fi: Nollaa

source: Cancel
fi: Peruuta
